zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/misc/nordic-nrf-ficr-nrf54h20.h
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 * SPDX-License-Identifier: Apache-2.0
 */

/* autogenerated using Nordic HAL utils/gen_offsets.py script */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_MISC_NORDIC_NRF_FICR_NRF54H20_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_MISC_NORDIC_NRF_FICR_NRF54H20_H_

#define NRF_FICR_BLE_ADDRTYPE                              0x00CU
#define NRF_FICR_BLE_ADDR_0                                0x010U
#define NRF_FICR_BLE_ADDR_1                                0x014U
#define NRF_FICR_BLE_ER_0                                  0x018U
#define NRF_FICR_BLE_ER_1                                  0x01CU
#define NRF_FICR_BLE_ER_2                                  0x020U
#define NRF_FICR_BLE_ER_3                                  0x024U
#define NRF_FICR_BLE_IR_0                                  0x028U
#define NRF_FICR_BLE_IR_1                                  0x02CU
#define NRF_FICR_BLE_IR_2                                  0x030U
#define NRF_FICR_BLE_IR_3                                  0x034U
#define NRF_FICR_NFC_TAGHEADER_0                           0x040U
#define NRF_FICR_NFC_TAGHEADER_1                           0x044U
#define NRF_FICR_NFC_TAGHEADER_2                           0x048U
#define NRF_FICR_NFC_TAGHEADER_3                           0x04CU
#define NRF_FICR_INFO_CONFIGID                             0x050U
#define NRF_FICR_INFO_PART                                 0x054U
#define NRF_FICR_INFO_VARIANT                              0x058U
#define NRF_FICR_INFO_PACKAGE                              0x05CU
#define NRF_FICR_INFO_RAM                                  0x060U
#define NRF_FICR_INFO_MRAM                                 0x064U
#define NRF_FICR_INFO_CODEPAGESIZE                         0x068U
#define NRF_FICR_INFO_CODESIZE                             0x06CU
#define NRF_FICR_INFO_DEVICETYPE                           0x070U
#define NRF_FICR_TRIM_GLOBAL_SAADC_CAL_0                   0x388U
#define NRF_FICR_TRIM_GLOBAL_SAADC_CAL_1                   0x38CU
#define NRF_FICR_TRIM_GLOBAL_SAADC_CAL_2                   0x390U
#define NRF_FICR_TRIM_GLOBAL_SAADC_CALREF                  0x394U
#define NRF_FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_0           0x398U
#define NRF_FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_1           0x39CU
#define NRF_FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_2           0x3A0U
#define NRF_FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_3           0x3A4U
#define NRF_FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_4           0x3A8U
#define NRF_FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_5           0x3ACU
#define NRF_FICR_TRIM_GLOBAL_NFCT_BIASCFG                  0x3B4U
#define NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE             0x3B8U
#define NRF_FICR_TRIM_GLOBAL_COMP_REFTRIM                  0x3C0U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP          0x3C8U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_0      0x3CCU
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_1      0x3D0U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_2      0x3D4U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_3      0x3D8U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_4      0x3DCU
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_5      0x3E0U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_0        0x3E4U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_1        0x3E8U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_2        0x3ECU
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_3        0x3F0U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_4        0x3F4U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_5        0x3F8U
#define NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_TCOEF         0x3FCU
#define NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_0_TRIM 0x400U
#define NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_1_TRIM 0x404U
#define NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_2_TRIM 0x408U
#define NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_3_TRIM 0x40CU
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP            0x410U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_0        0x414U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_1        0x418U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_2        0x41CU
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_3        0x420U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_4        0x424U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_5        0x428U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_0          0x42CU
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_1          0x430U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_2          0x434U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_3          0x438U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_4          0x43CU
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_5          0x440U
#define NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_TCOEF           0x444U
#define NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_0_TRIM   0x448U
#define NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_1_TRIM   0x44CU
#define NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_2_TRIM   0x450U
#define NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_3_TRIM   0x454U

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_MISC_NORDIC_NRF_FICR_NRF54H20_H_ */
